<?php

use Illuminate\Support\Arr;

if (!function_exists('adressExploder')) {
    function adressExploder($string) {
        return explodeToCatWithGroup("^(?#ОБЛАСТЬ)(?<obl>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl1>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#РАЙОНЫ)(?=([\w -]+район|район [\w -]+))(?<rayon>[\w -]+район|район [\w -]+) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village1>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#РАЙОН)(?<rayon1>(?=[\w -]+ район)[\w -]+ район) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village2>дачный пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl2>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#РАЙОН)(?<rayon2>(?=[\w -]+ район)[\w -]+ район) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+|[\w -]+ поселение))(?<village_rayon>дачный пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+|[\w -]+ поселение) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village3>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$(?#
------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl3>(?=[\w -]+ область)[\w -]+ область) ?, ?(?=([\w -]+ городской округ|городской округ [\w -]+))(?<okrug>[\w -]+ городской округ|городской округ [\w -]+) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village4>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$(?#
------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl4>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#ОКРУГ)(?=([\w -]+ городской округ|городской округ [\w -]+))(?<okrug1>[\w -]+ городской округ|городской округ [\w -]+) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village5>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+) ?, ?(?<st>.*)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl5>(?=[\w -]+ область)[\w -]+ область) ?, ?(?=([\w -]+ городской округ|городской округ [\w -]+))(?<okrug2>[\w -]+ городской округ|городской округ [\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl6>(?=[\w -]+ область)[\w -]+ область) ?, ?(?=([\w -]+ городской округ|городской округ [\w -]+))(?<okrug3>[\w -]+ городской округ|городской округ [\w -]+) ?, ?(?<town>[\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl7>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#ОКРУГ)(?=([\w -]+ городской округ|городской округ [\w -]+))(?<okrug4>[\w -]+ городской округ|городской округ [\w -]+) ?, ?(?#ГОРОД)(?!.*километр)(?<town1>[\w -]+) ?, ?(?<st1>.*)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl8>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#ОКРУГ)(?=([\w -]+ городской округ|городской округ [\w -]+))(?<okrug5>[\w -]+ городской округ|городской округ [\w -]+) ?, ?(?#Шоссе)(?=.*километр)(?<highway>.*)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl9>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#ОКРУГ)(?=([\w -]+ муниципальный округ|[\w -]+ городской округ|городской округ [\w -]+))(?<okrug6>[\w -]+ муниципальный округ|[\w -]+ городской округ|городской округ [\w -]+) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village6>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl10>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#РАЙОНЫ)(?=([\w -]+район|район [\w -]+))(?<rayon3>[\w -]+район|район [\w -]+) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village7>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+) ?, ?(?<st2>.*)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl11>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#РАЙОНЫ)(?=([\w -]+район|район [\w -]+))(?<rayon4>[\w -]+район|район [\w -]+) ?, ?(?#МУНИЦИПАЛ)(?=(муниципальное образование [\w -]+))(?<town2>муниципальное образование [\w -]+) ?, ?(?#СЁЛА)(?=(сельский пос.лок [\w -]+|дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village8>сельский пос.лок [\w -]+|дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$|(#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl12>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#РАЙОНЫ)(?=([\w -]+район|район [\w -]+))(?<rayon5>[\w -]+район|район [\w -]+) ?, ?(?<highway1>.-\d [\w]+ ?, ?\d+-. километр)$(#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl13>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#ГОРОД)(?<town4>[\w+-]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl14>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#ГОРОД)(?<town5>[\w+-]+) ?, ?(?<st3>[\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl15>[\w -]+ область) ?, ?(?<st4>[\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ГОРОД МСК)(?<msk>Москва) ?, ?(?<town3>[\w -]+) ?, ?(?#ШОССЕ)(?=.*шоссе)(?<highway2>.*)(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl16>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village9>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+) ?, ?(?#УЛИЦА)(?<st5>.+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl17>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#РАЙОНЫ)(?=([\w -]+район|район [\w -]+))(?<rayon6>[\w -]+район|район [\w -]+) ?, ?(?!.*улица)(?<town6>[\w -]+)$
|^(?#ОБЛАСТЬ)(?<obl18>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#ГОРОД)(?<town7>[\w -]+) ?, ?(?!.+ пос.лок|.+ село|.+деоевня|.+шоссе)(?<st6>.*)$(?#РАЙОН)(?<rayon7>(?=[\w -]+ район)[\w -]+ район) ?, ?(?<village_rayon1>[\w -]+ поселение) ?, ?(?#СЁЛА)(?=(деревня|дачный пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village10>деревня [\w -]+|дачный пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?!.*область)(?<town8>(?:городской округ [\w-]+)|(?:[\w-]+))$(?#
--------------------------------------------------------------------------------------------
)|^(?#ГОРОД)(?!.*область|[\w -]+ район)((?<town9>(?:городской округ [\w-]+)|(?:[\w-]+))\s*,\s*(?=|.*переулок|.*улица|.*проспект|.*площадь|.*микрорайон|.*СНТ)(?!.*пос.лок|.*сельский пос.лок|.*деревня)(?#УЛИЦА)(?<st7>[а-яё0-9- №\.]+$|[а-яё0-9- \.]+\s*,\s*[\w\d\/ -№\.]+)|(?=.*пос.лок)(?<town55>(?:городской округ [\w-]+)|(?:[\w-]+))\s*,\s*(?#СЕЛО)(?<village88>сельский пос.лок [\w -]+|дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?=.+Крым)((?<obl19>[\w -]+)\s*,\s*(?#ГОРОД)(?<town10>(?:городской округ [\w -]+|[\w-]+))\s*,\s*(?=.+улица|.*переулок|.*квартал|.*сквер|.*дорога)(?!.*пос.лок)(?#УЛИЦА)(?<st8>.+)|(?#ОБЛАСТЬ)(?<obl20>[\w -]+)\s*,\s*(?#ГОРОД)(?<town11>(?:городской округ [\w -]+|[\w-]+))\s*,\s*(?!.+улица|.*переулок|.*квартал|.*сквер|.*дорога)(?=.*пос.лок)(?#СЕЛО)(?<village11>.+)|(?#ОБЛАСТЬ)(?<obl21>[\w -]+)\s*,\s*(?#ГОРОД)(?<town12>(?:городской округ [\w -]+|[\w-]+))\s*,\s*(?#СЕЛО)(?=.*пос.лок)(?<village12>[\w -]+)\s*.\s*(?#УЛИЦА)(?=.*улица)(?<st9>.+)|(?<obl22>[\w -]+)\s*,\s*(?<town13>(?:городской округ [\w -]+|[\w-]+)))$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?=.+край)(?<obl23>[\w -]+)\s*,\s*(?#ГОРОД)(?<town14>(?:муниципальное образование [\w-]+|[\w -]+)|(?<town15>(?:муниципальное образование [\w-]+|[\w -]+))\s*,\s*(?#Улица)((?!.*село|.*пос.лок|.*деревня)(?<st10>[\w -]+$|[\w -]+\s*,\s*\d+\w+$)|(?#СЕЛО)(?=.*село|.*пос.лок|.*деревня)(?<village13>.+)|(?#РАЙОН)(?=.+район)(?<rayon8>[\w -]+)\s*,\s*(?<st11>.*)))$", $string);
    }
}
if (!function_exists('explodeGroopsToArr')) {
    function explodeGroopsToArr(array $patterns, string $string) {
        $groops = [];
        $cursor = 0;
        foreach ($patterns as $key => $reg) {
            if (preg_match("/$patterns[$key]/uiU", $string, $matches, 0, $cursor)) {
                $cursor += strlen($matches[0]);
                $collect = collect(array_filter($matches, "is_string", ARRAY_FILTER_USE_KEY));
                foreach ($collect as $key => $value) {
                    $groops[$key] = $value;
                }
            }else{
                continue;
            }
        }
        return $groops;
    }
}
if (!function_exists('explodeToCatWithGroup')) {
    function explodeToCatWithGroup($pattern, $string) {
        // Выводит только именнованные группы !!!!
        $all = [];
        if (is_array($pattern)) {
            foreach ($pattern as $key => $value) {
                $reg = preg_match("/$pattern[$key]/ui", $string, $res);
                $array_filtered = array_filter($res, "is_string", ARRAY_FILTER_USE_KEY);
            }
            return $all;
        }
        preg_match("/$pattern/ui", $string, $res, PREG_UNMATCHED_AS_NULL);
        $array_filtered = array_filter($res, "is_string", ARRAY_FILTER_USE_KEY);
        $clear = Arr::whereNotNull($array_filtered);
        foreach ($clear as $key => $value) {
            $k = preg_replace([
                '/obl[0-9]+/ui',
                '/msk[0-9]+/ui',
                '/town[0-9]+/ui',
                '/okrug[0-9]+/ui',
                '/village[0-9]+/ui',
                '/st[0-9]+/ui',
            ], ['obl', 'msk', 'town', 'okrug', 'village', 'st'], $key);
            $all[$k] = $value;
        }
        return $all;
    }
}
if (!function_exists('explodeToCat')) {
    function explodeToCat($pattern, $string) {
        $all = [];
        if (is_array($pattern)) {
            foreach ($pattern as $key => $value) {
                $reg = preg_match("/($pattern[$key])/ui", $string, $res);
                if ($res) {
                    $all[$key] = array_unique($res)[0];
                }
            }
            return $all;
        }
        preg_match("/^.*($pattern).*$/ui", $string, $res);
        return $res;
    }
}
if (!function_exists('explodAndFindAddress')) {
    function explodAndFindAddress($pattern, $address) {
        $keywords = preg_match("/$pattern/ui", $address,$matches);
        return $matches;
    }
}

/*
^(?#ОБЛАСТЬ)(?<obl>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl1>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#РАЙОНЫ)(?=([\w -]+район|район [\w -]+))(?<rayon>[\w -]+район|район [\w -]+) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village1>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#РАЙОН)(?<rayon1>(?=[\w -]+ район)[\w -]+ район) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village2>дачный пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl2>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#РАЙОН)(?<rayon2>(?=[\w -]+ район)[\w -]+ район) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+|[\w -]+ поселение))(?<village_rayon>дачный пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+|[\w -]+ поселение) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village3>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$(?#
------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl3>(?=[\w -]+ область)[\w -]+ область) ?, ?(?=([\w -]+ городской округ|городской округ [\w -]+))(?<okrug>[\w -]+ городской округ|городской округ [\w -]+) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village4>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$(?#
------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl4>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#ОКРУГ)(?=([\w -]+ городской округ|городской округ [\w -]+))(?<okrug1>[\w -]+ городской округ|городской округ [\w -]+) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village5>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+) ?, ?(?<st>.*)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl5>(?=[\w -]+ область)[\w -]+ область) ?, ?(?=([\w -]+ городской округ|городской округ [\w -]+))(?<okrug2>[\w -]+ городской округ|городской округ [\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl6>(?=[\w -]+ область)[\w -]+ область) ?, ?(?=([\w -]+ городской округ|городской округ [\w -]+))(?<okrug3>[\w -]+ городской округ|городской округ [\w -]+) ?, ?(?<town>[\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl7>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#ОКРУГ)(?=([\w -]+ городской округ|городской округ [\w -]+))(?<okrug4>[\w -]+ городской округ|городской округ [\w -]+) ?, ?(?#ГОРОД)(?!.*километр)(?<town1>[\w -]+) ?, ?(?<st1>.*)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl8>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#ОКРУГ)(?=([\w -]+ городской округ|городской округ [\w -]+))(?<okrug5>[\w -]+ городской округ|городской округ [\w -]+) ?, ?(?#Шоссе)(?=.*километр)(?<highway>.*)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl9>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#ОКРУГ)(?=([\w -]+ муниципальный округ|[\w -]+ городской округ|городской округ [\w -]+))(?<okrug6>[\w -]+ муниципальный округ|[\w -]+ городской округ|городской округ [\w -]+) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village6>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl10>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#РАЙОНЫ)(?=([\w -]+район|район [\w -]+))(?<rayon3>[\w -]+район|район [\w -]+) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village7>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+) ?, ?(?<st2>.*)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl11>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#РАЙОНЫ)(?=([\w -]+район|район [\w -]+))(?<rayon4>[\w -]+район|район [\w -]+) ?, ?(?#МУНИЦИПАЛ)(?=(муниципальное образование [\w -]+))(?<town2>муниципальное образование [\w -]+) ?, ?(?#СЁЛА)(?=(сельский пос.лок [\w -]+|дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village8>сельский пос.лок [\w -]+|дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$|(#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl12>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#РАЙОНЫ)(?=([\w -]+район|район [\w -]+))(?<rayon5>[\w -]+район|район [\w -]+) ?, ?(?<highway1>.-\d [\w]+ ?, ?\d+-. километр)$(#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl13>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#ГОРОД)(?<town4>[\w+-]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl14>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#ГОРОД)(?<town5>[\w+-]+) ?, ?(?<st3>[\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl15>[\w -]+ область) ?, ?(?<st4>[\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ГОРОД МСК)(?<msk>Москва) ?, ?(?<town3>[\w -]+) ?, ?(?#ШОССЕ)(?=.*шоссе)(?<highway2>.*)(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl16>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#СЁЛА)(?=(дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village9>дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+) ?, ?(?#УЛИЦА)(?<st5>.+)$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?<obl17>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#РАЙОНЫ)(?=([\w -]+район|район [\w -]+))(?<rayon6>[\w -]+район|район [\w -]+) ?, ?(?!.*улица)(?<town6>[\w -]+)$
|^(?#ОБЛАСТЬ)(?<obl18>(?=[\w -]+ область)[\w -]+ область) ?, ?(?#ГОРОД)(?<town7>[\w -]+) ?, ?(?!.+ пос.лок|.+ село|.+деоевня|.+шоссе)(?<st6>.*)$(?#РАЙОН)(?<rayon7>(?=[\w -]+ район)[\w -]+ район) ?, ?(?<village_rayon1>[\w -]+ поселение) ?, ?(?#СЁЛА)(?=(деревня|дачный пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))(?<village10>деревня [\w -]+|дачный пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+)$(?#
--------------------------------------------------------------------------------------------
)|^(?!.*область)(?<town8>(?:городской округ [\w-]+)|(?:[\w-]+))$(?#
--------------------------------------------------------------------------------------------
)|^(?#ГОРОД)(?!.*область|[\w -]+ район)((?<town9>(?:городской округ [\w-]+)|(?:[\w-]+))\s*,\s*(?=|.*переулок|.*улица|.*проспект|.*площадь|.*микрорайон|.*СНТ)(?!.*пос.лок|.*сельский пос.лок|.*деревня)(?#УЛИЦА)(?<st7>[а-яё0-9- №\.]+$|[а-яё0-9- \.]+\s*,\s*[\w\d\/ -№\.]+)|(?=.*пос.лок)(?<town55>(?:городской округ [\w-]+)|(?:[\w-]+))\s*,\s*(?#СЕЛО)(?<village88>сельский пос.лок [\w -]+|дачный пос.лок [\w -]+|деревня [\w -]+|городской пос.лок [\w -]+|с.ло [\w -]+|пос.лок [\w -]+|рабочий пос.лок [\w -]+))$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?=.+Крым)((?<obl19>[\w -]+)\s*,\s*(?#ГОРОД)(?<town10>(?:городской округ [\w -]+|[\w-]+))\s*,\s*(?=.+улица|.*переулок|.*квартал|.*сквер|.*дорога)(?!.*пос.лок)(?#УЛИЦА)(?<st8>.+)|(?#ОБЛАСТЬ)(?<obl20>[\w -]+)\s*,\s*(?#ГОРОД)(?<town11>(?:городской округ [\w -]+|[\w-]+))\s*,\s*(?!.+улица|.*переулок|.*квартал|.*сквер|.*дорога)(?=.*пос.лок)(?#СЕЛО)(?<village11>.+)|(?#ОБЛАСТЬ)(?<obl21>[\w -]+)\s*,\s*(?#ГОРОД)(?<town12>(?:городской округ [\w -]+|[\w-]+))\s*,\s*(?#СЕЛО)(?=.*пос.лок)(?<village12>[\w -]+)\s*.\s*(?#УЛИЦА)(?=.*улица)(?<st9>.+)|(?<obl22>[\w -]+)\s*,\s*(?<town13>(?:городской округ [\w -]+|[\w-]+)))$(?#
--------------------------------------------------------------------------------------------
)|^(?#ОБЛАСТЬ)(?=.+край)(?<obl23>[\w -]+)\s*,\s*(?#ГОРОД)(?<town14>(?:муниципальное образование [\w-]+|[\w -]+)|(?<town15>(?:муниципальное образование [\w-]+|[\w -]+))\s*,\s*(?#Улица)((?!.*село|.*пос.лок|.*деревня)(?<st10>[\w -]+$|[\w -]+\s*,\s*\d+\w+$)|(?#СЕЛО)(?=.*село|.*пос.лок|.*деревня)(?<village13>.+)|(?#РАЙОН)(?=.+район)(?<rayon8>[\w -]+)\s*,\s*(?<st11>.*)))$

*/





/*

(?P<obl>.+) (?:край|область)\s*,\s*(?:(?P<town1>[\w-]+) городской округ|(?:городской округ|город|муниципальный округ)?\s*(?P<town2>[\w\d-]+))$(?#
!!!!!
)|^.+\s*,\s*(?:деревня|пос.лок|рабочий пос.лок|село) ((?=.*\d)[\w\d ,-]+|[\w\d -]+)

*/